balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F8525.PIC
      <edc:DCRDef edc:access="nnn-----" edc:cname="CONFIG6H" edc:default="0xe0" edc:desc="" edc:impl="0xe0" edc:name="CONFIG6H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="WRTC" edc:desc="Configuration Register Write Protection bit" edc:mask="0x1" edc:name="WRTC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration registers (300000-3000FFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration registers (300000-3000FFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTB" edc:desc="Boot Block Write Protection bit" edc:mask="0x1" edc:name="WRTB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot block (000000-0007FFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot block (000000-0007FFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTD" edc:desc="Data EEPROM Write Protection bit" edc:mask="0x1" edc:name="WRTD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----nnnn" edc:cname="CONFIG7L" edc:default="0xf" edc:desc="" edc:impl="0xf" edc:name="CONFIG7L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="EBTR0" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 (000800-003FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 (000800-003FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR1" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 (004000-007FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 (004000-007FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR2" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 2 (008000-00BFFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 2 (008000-00BFFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="RES" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="" edc:desc="Maintain bit as 1." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-n------" edc:cname="CONFIG7H" edc:default="0x40" edc:desc="" edc:impl="0x40" edc:name="CONFIG7H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x40">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="EBTRB" edc:desc="Boot Block Table Read Protection bit" edc:mask="0x1" edc:name="EBTRB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot block (000000-0007FFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot block (000000-0007FFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:DeviceIDSector edc:beginaddr="0x3ffffe" edc:endaddr="0x400000" edc:mask="0xffe0" edc:regionid="devid" edc:value="0xac0">
      <edc:DEVIDToRev edc:revlist="a0" edc:value="0xac0"/>
      <edc:DEVIDToRev edc:revlist="a1" edc:value="0xac1"/>
    </edc:DeviceIDSector>
    <edc:EEDataSector edc:beginaddr="0xf00000" edc:endaddr="0xf00400" edc:regionid="eedata"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x200028" edc:endaddr="0x200038" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x1000">
    <edc:RegardlessOfMode>
      <edc:GPRDataSector edc:bank="0x0" edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="accessram"/>
      <edc:GPRDataSector edc:bank="0x0" edc:beginaddr="0x60" edc:endaddr="0x100" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0x1" edc:beginaddr="0x100" edc:endaddr="0x200" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="0x2" edc:beginaddr="0x200" edc:endaddr="0x300" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="0x3" edc:beginaddr="0x300" edc:endaddr="0x400" edc:regionid="gpr3"/>
      <edc:GPRDataSector edc:bank="0x4" edc:beginaddr="0x400" edc:endaddr="0x500" edc:regionid="gpr4"/>
      <edc:GPRDataSector edc:bank="0x5" edc:beginaddr="0x500" edc:endaddr="0x600" edc:regionid="gpr5"/>
      <edc:GPRDataSector edc:bank="0x6" edc:beginaddr="0x600" edc:endaddr="0x700" edc:regionid="gpr6"/>
      <edc:GPRDataSector edc:bank="0x7" edc:beginaddr="0x700" edc:endaddr="0x800" edc:regionid="gpr7"/>
      <edc:GPRDataSector edc:bank="0x8" edc:beginaddr="0x800" edc:endaddr="0x900" edc:regionid="gpr8"/>
      <edc:GPRDataSector edc:bank="0x9" edc:beginaddr="0x900" edc:endaddr="0xa00" edc:regionid="gpr9"/>
      <edc:GPRDataSector edc:bank="0xa" edc:beginaddr="0xa00" edc:endaddr="0xb00" edc:regionid="gpr10"/>
      <edc:GPRDataSector edc:bank="0xb" edc:beginaddr="0xb00" edc:endaddr="0xc00" edc:regionid="gpr11"/>
      <edc:GPRDataSector edc:bank="0xc" edc:beginaddr="0xc00" edc:endaddr="0xd00" edc:regionid="gpr12"/>
      <edc:GPRDataSector edc:bank="0xd" edc:beginaddr="0xd00" edc:endaddr="0xe00" edc:regionid="gpr13"/>
      <edc:GPRDataSector edc:bank="0xe" edc:beginaddr="0xe00" edc:endaddr="0xf00" edc:regionid="gpr14"/>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:AdjustPoint edc:offset="7"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP2DEL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP2DEL" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM2CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P2DC" edc:desc="" edc:mask="0x7f" edc:name="P2DC" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="P2RSEN" edc:desc="" edc:mask="0x1" edc:name="P2RSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P2DC0" edc:desc="" edc:mask="0x1" edc:name="P2DC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2DC1" edc:desc="" edc:mask="0x1" edc:name="P2DC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2DC2" edc:desc="" edc:mask="0x1" edc:name="P2DC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2DC3" edc:desc="" edc:mask="0x1" edc:name="P2DC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2DC4" edc:desc="" edc:mask="0x1" edc:name="P2DC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2DC5" edc:desc="" edc:mask="0x1" edc:name="P2DC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2DC6" edc:desc="" edc:mask="0x1" edc:name="P2DC6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PDC0" edc:desc="" edc:mask="0x1" edc:name="PDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC1" edc:desc="" edc:mask="0x1" edc:name="PDC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC2" edc:desc="" edc:mask="0x1" edc:name="PDC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC3" edc:desc="" edc:mask="0x1" edc:name="PDC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC4" edc:desc="" edc:mask="0x1" edc:name="PDC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC5" edc:desc="" edc:mask="0x1" edc:name="PDC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC6" edc:desc="" edc:mask="0x1" edc:name="PDC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRSEN" edc:desc="" edc:mask="0x1" edc:name="PRSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
